<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Excel 2016 update (or standalone) pkg,
and appends the type and version to the end of the filename.

MSLOCALE sets the locale for a descriptive text that will be
extracted from the Microsoft update metadata. See
https://msdn.microsoft.com/en-us/goglobal/bb964664.aspx
for more information about locale IDs. Defaults to 1033 for English.

TYPE supports 'Combo', 'Delta', and 'Standalone' options.
</string>
	<key>Identifier</key>
	<string>com.github.UWO.autopkg.download.MicrosoftExcelAlone</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft Excel</string>
		<key>MSLOCALE</key>
		<string>1033</string>
		<key>MSPRODUCT</key>
		<string>Excel</string>
		<key>MSTYPE</key>
		<string>Combo</string>
		<!-- JSS-specific -->
		<key>SHORTNAME</key>
		<string>MicrosoftExcel</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MSOffice2016URLandUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>locale_id</key>
				<string>%MSLOCALE%</string>
				<key>product</key>
				<string>%MSPRODUCT%</string>
				<key>type</key>
				<string>%MSTYPE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%SHORTNAME%-%MSTYPE%-%version%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
