<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<!--Original recipe from com.github.autopkg.nmcspadden-recipes-->
<dict>
    <key>Description</key>
    <string>Downloads latest Google Earth Pro disk image.</string>
    <key>Identifier</key>
    <string>com.github.UWO.autopkg.download.google-earth-pro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleEarthPro</string>
        <key>DOWNLOAD_URL</key>
        <string>https://dl.google.com/earth/client/advanced/current/GoogleEarthProMacNoUpdate-Intel.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Google, Inc. (EQHXZ8M8AV)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
