<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <!--Original recipe from com.github.hansen-m-->
<dict>
    <key>Description</key>
    <string>Downloads the latest RStudio installer package.</string>
    <key>Identifier</key>
    <string>com.github.UWO.autopkg.download.RStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RStudio</string>
        <key>SEARCH_URL</key>
        <string>https://www.rstudio.com/products/rstudio/download/</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;dmg&gt;RStudio-(?P&lt;version&gt;[0-9.]+)\.dmg)</string>
        <key>DOWNLOAD_MIRROR</key>
        <string>http://download1.rstudio.org</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>CURLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_MIRROR%/%dmg%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
