<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<!--Original recipe from com.github.keeleysam -->
<dict>
	<key>Description</key>
	<string>Installs the current release version of CarbonCopyCloner.</string>
	<key>Identifier</key>
	<string>com.github.UWO.autopkg.CarbonCopyCloner.install</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CarbonCopyCloner</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.UWO.autopkg.pkg.CarbonCopyCloner</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
