<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<!--Original recipe from com.github.keeleysam.recipes -->
	<dict>
		<key>Description</key>
		<string>Downloads the current version of FileZilla. Specify the channel via %NAME%.</string>
		<key>Identifier</key>
		<string>com.github.UWO.autopkg.FileZilla.download</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>FileZilla</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>product_name</key>
					<string>%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>FileZillaURLProvider</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>CHECK_FILESIZE_ONLY</key>
					<true/>
					<key>filename</key>
					<string>%NAME%.tar.bz2</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
	</plist>
