<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of TeamViewer QuickSupport and imports into Munki. TeamViewer QuickSupport is a simple and small customer module, runs immediately without installation and does not require administrative rights - optimized for instant support</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.munki.TeamViewerQS</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeamViewerQS</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/TeamViewer/QS</string>
		<key>MUNKI_CATEGORY</key>
		<string>Support</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>TeamViewer QuickSupport</string>
				<string>TeamViewerQS</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>Incoming</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>All-In-One Solution for Remote Access and Support over the Internet.</string>
			<key>developer</key>
			<string>TeamViewer GmbH</string>
			<key>display_name</key>
			<string>TeamViewer QuickSupport</string>
			<key>minimum_os_version</key>
			<string>10.5</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.TeamViewerQS</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
