<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports the VMwareFusion app into Munki.</string>
	<key>Identifier</key>
	<string>com.github.MIO.munki.VMwareFusion</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VMwareFusion</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/VMware/fusion</string>
		<key>pkginfo</key>
		<dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>display_name</key>
			<string>VMWare Fusion Pro</string>
			<key>category</key>
			<string>VMware</string>
			<key>developer</key>
			<string>VMware</string>
			<key>description</key>
			<string></string>
			<key>catalogs</key>
			<array>
				<string>Incoming</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.5</string>
	<key>ParentRecipe</key>
	<string>com.github.MIO.download.VMwareFusion</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/tar</string>
				<key>purge_destination</key>
				<true/>
				<key>archive_format</key>
				<string>tar</string>
			</dict>
		</dict>
 		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/tar/com.vmware.fusion.zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/source</string>
				<key>purge_destination</key>
				<true/>
				<key>archive_format</key>
				<string>zip</string>
			</dict>
		</dict>
 		<dict>
			<key>Comment</key>
			<string>Extract a version string from Info.plist to use for the package.</string>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/source/payload/VMware Fusion.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/source/payload/VMware Fusion.app</string>
				<key>destination_path</key>
				<string>%pkgroot%/VMware Fusion.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%pkgroot%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
