<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<!--Original recipe from com.github.jessepeterson.-->
<dict>
	<key>Description</key>
	<string>Empty recipe that simply uses the download recipe (as it downloads a pkg)</string>
	<key>Identifier</key>
	<string>com.github.UWO.autopkg.pkg.dockutil</string>
	<key>ParentRecipe</key>
	<string>com.github.UWO.autopkg.download.dockutil</string>
	<key>Input</key>
	<dict/>
</dict>
</plist>
